{"name": "Amr Mohammed", "email": "amrm88289@gmail.com", "phone": "+201093118308", "location": "Giza, Egypt", "linkedin": "linkedin.com/in/amr-mohammed-788913348", "github": "github.com/AmrMohamed17", "website": "kaggle.com/amr132", "summary": "Enthusiastic and knowledgeable Machine Learning Engineer intern eager to apply foundational skills in developing and deploying ML models. Comfortable with TensorFlow, PyTorch, and Scikit-learn, and seeking opportunities to contribute to real-world projects involving recommendation systems, computer vision, and LLM-powered applications.", "skills": [{"category": "Programming Languages", "technologies": "Python, C++, SQL, C"}, {"category": "ML & Data Science", "technologies": "TensorFlow, PyTorch, Scikit-learn, Reinforcement Learning"}, {"category": "Web & APIs", "technologies": "Flask, Gemini API, GitHub API, ONNX"}], "experience": [{"title": "AI Internship", "company": "Elevvo", "duration": "Jun 2024 - Present", "responsibilities": "Developed machine learning models for tasks like regression, classification, and recommendation using real-world datasets from Kaggle and UCI.\nApplied deep learning techniques with TensorFlow and Keras, focusing on evaluation metrics, model tuning, and deployment readiness.\n"}, {"title": "TeamWork", "company": "Local Product Finder (GP)", "duration": "Jul 2024 - Jun 2025", "responsibilities": "Created a mobile app that identifies products from images using MobileNet with 99% accuracy.\nBuilt a hybrid recommendation system combining content-based filtering (Sentence-BERT) and collaborative filtering (LightFM). The system suggests local alternatives when a non-local product is detected, improving over time based on user choices.\n"}, {"title": "TeamWork", "company": "AlphaLearn Game", "duration": "Jul 2024 - May 2025", "responsibilities": "Developed a Unity game where difficulty adapts to player performance using reinforcement learning.\nIntegrated an ONNX model that adjusts speed and obstacles in real-time based on player score.\n"}], "education": [{"degree": "BSc., Computer Science", "school": "University of Ein Shams", "year": "2021 - 2025", "achievements": "Cumulative Grade: B, GP: A\nCoursework: Introduction to Machine Learning, Data Science, Neural Network\n"}, {"degree": "High School Diploma", "school": "Tiba International School", "year": "2017 - 2020", "achievements": "SAT: 1270 , ACT: 31\n"}], "projects": [{"name": "AI-Powered Resume Builder", "description": "Developing a full-stack web app that transforms old resumes and LinkedIn/GitHub data into ATS-compliant CVs using the Gemini LLM API and NLP-based data extraction.\nBuilding an editor with real-time content editing and PDF export, leveraging Flask, PyMuPDF, and a modular architecture.\n", "technologies": "Flask, PyMuPDF, Gemini API", "duration": "May 2025 - Present"}, {"name": "Cancer-prediction", "description": "Implemented machine learning models to classify breast cancer tumors as malignant or benign based on features extracted from digitized images of fine needle aspirates (FNA) of breast masses.\nUtilized the Breast Cancer Wisconsin (Diagnostic) dataset, which includes features computed from a digitized image of a fine needle aspirate of a breast mass.\n", "technologies": "Jupyter Notebook", "duration": null}, {"name": "car-price-prediction", "description": "Predicted car prices using machine learning techniques, including data preprocessing, exploratory data analysis, and the implementation of a Linear Regression model.\nPredicted car prices based on various features.\n", "technologies": "Jupyter Notebook", "duration": null}, {"name": "Cervical_Cancer_Prediction", "description": "Analyzed cervical cancer risk factors and built a predictive model using machine learning techniques.\nIncluded data preprocessing, exploratory data analysis, and the implementation of an XGBoost classifier to predict biopsy results.\n", "technologies": "Jupyter Notebook", "duration": null}, {"name": "Customer-satisfaction-with-MLOps", "description": "Predicted the review score for the next order or purchase using a customer's historical data.\nUtilized the Brazilian E-Commerce Public Dataset by Olist, which has information on 100,000 orders from 2016 to 2018.\n", "technologies": "Python", "duration": null}], "certificates": [{"name": "Mathematics for Machine Learning", "issuer": "DeepLearning.AI / Coursera", "year": "2023", "description": "This certificate covers linear algebra, calculus, and probability concepts essential for machine learning. It enhances understanding of techniques like principal component analysis and optimization."}, {"name": "CS50’s Introduction to Artificial Intelligence with Python", "issuer": "Harvard Course", "year": "2022", "description": "This certificate covers fundamental AI concepts including search algorithms, logic, probability, and machine learning. Projects include building a Tic-Tac-Toe bot using Minimax and a PageRank-based search engine."}, {"name": "CS50: Introduction to Computer Science", "issuer": "Harvard Course", "year": "2021", "description": "This certificate covers programming fundamentals using C and Python. Projects include building a finance web app using Flask and SQL, and a Breakout game using C and SDL."}]}