{"name": "Amr Mohammed", "email": "amrm88289@gmail.com", "phone": "+201093118308", "location": "Giza, Egypt", "linkedin": "linkedin.com/in/amr-mohammed-788913348", "github": "github.com/AmrMohamed17", "website": "kaggle.com/amr132", "summary": "Aspiring ML Engineer with a passion for developing intelligent solutions. Eager to apply foundational knowledge in machine learning, deep learning, and related technologies to real-world challenges. Hands-on experience with Python, TensorFlow, and Scikit-learn, and a strong desire to contribute to innovative projects.", "skills": [{"category": "Programming Languages", "technologies": "Python, C++, C#, Dart, HTML, SQL"}, {"category": "ML & Deep Learning", "technologies": "TensorFlow, PyTorch, Scikit-learn, Keras, ONNX, Reinforcement Learning"}, {"category": "Data Science & Analytics", "technologies": "Data Structures, PySpark, Jupyter Notebook, Pandas, NumPy, Seaborn"}, {"category": "Web Development & APIs", "technologies": "Flask, GitHub API, Gemini API, REST APIs, HTML, CSS"}, {"category": "Software Development", "technologies": "Linux, OOP, Git, Agile, Modular Architecture, SDLC"}], "experience": [{"title": "AI Internship", "company": "Elevvo", "date_from": "Jun 2024", "date_to": "Present", "responsibilities": "Developed machine learning models for regression, classification, and recommendation tasks using Kaggle and UCI datasets.\nApplied deep learning techniques with TensorFlow and Keras, focusing on evaluation metrics and model tuning.\n"}], "education": [{"degree": "BSc., Computer Science", "school": "University of Ein Shams", "date_from": "Oct 2021", "date_to": "Aug 2025", "achievements": "Cumulative Grade: B, GP: A\nCoursework: Introduction to Machine Learning, Data Science, Neural Network\n"}, {"degree": "High School Diploma", "school": "Tiba International School", "date_from": "Sep 2017", "date_to": "Jun 2020", "achievements": "SAT: 1270 , ACT: 31\n"}], "projects": [{"name": "AI-Powered Resume Builder", "date_from": "May 2025", "date_to": "Present", "link": null, "description": "Developing a full-stack web app to transform resumes and online profiles into ATS-compliant CVs using the Gemini LLM API and NLP.\nBuilding a real-time content editor with PDF export, leveraging Flask, PyMuPDF, and a modular architecture.\n"}, {"name": "Local Product Finder (GP)", "date_from": "Jul 2024", "date_to": "Jun 2025", "link": null, "description": "Created a mobile app that identifies products from images using MobileNet with 99% accuracy.\nBuilt a hybrid recommendation system combining content-based filtering (Sentence-BERT) and collaborative filtering (LightFM) to suggest local alternatives.\n"}, {"name": "AlphaLearn Game", "date_from": "Jul 2024", "date_to": "May 2025", "link": null, "description": "Developed a Unity game where difficulty adapts to player performance using reinforcement learning.\nIntegrated an ONNX model that adjusts speed and obstacles in real-time based on player score.\n"}, {"name": "Cancer-prediction", "date_from": null, "date_to": null, "link": null, "description": "Implemented machine learning models to classify breast cancer tumors as malignant or benign based on features extracted from digitized images.\nUtilized the Breast Cancer Wisconsin (Diagnostic) dataset.\n"}, {"name": "car-price-prediction", "date_from": null, "date_to": null, "link": null, "description": "Predicted car prices using machine learning techniques, including data preprocessing, exploratory data analysis, and Linear Regression.\n"}], "certificates": [{"name": "Mathematics for Machine Learning", "issuer": "DeepLearning.AI / Coursera", "year": "2024", "description": "Learned linear algebra, calculus, and probability concepts and applied them to machine learning applications. Enhanced understanding of principal component analysis, vector transformations, and optimization techniques."}, {"name": "CS50’s Introduction to Artificial Intelligence with Python", "issuer": "Harvard Course", "year": "2023", "description": "Studied search algorithms, logic, probability, and machine learning. Created AI projects such as a Tic-Tac-Toe bot using Minimax, a logic puzzle solver, and a PageRank-based search engine."}, {"name": "CS50: Introduction to Computer Science", "issuer": "Harvard Course", "year": "2022", "description": "Learned programming fundamentals using C and Python. Built projects including a finance web app using Flask and SQL, and a Breakout game using C and SDL."}]}