{"name": "Amr Mohammed", "email": "amrm88289@gmail.com", "phone": "+201093118308", "location": "Giza, Egypt", "linkedin": "linkedin.com/in/amr-mohammed-788913348", "github": "github.com/AmrMohamed17", "website": "kaggle.com/amr132", "summary": "Aspiring Machine Learning Engineer with a solid foundation in data structures and algorithms, object-oriented programming, and version control using Git. Eager to apply knowledge of Python, TensorFlow, and Scikit-learn to develop intelligent solutions and contribute to real-world machine learning projects.", "skills": [{"category": "Programming Languages", "technologies": "Python, C++, C#, SQL, Dart, HTML"}, {"category": "ML & Deep Learning", "technologies": "TensorFlow, PyTorch, Scikit-learn, Keras, ONNX, Reinforcement Learning"}, {"category": "Data Science & Analytics", "technologies": "Data Structures, Pandas, NumPy, Seaborn, PySpark, Jupyter Notebook"}, {"category": "Web Development & APIs", "technologies": "Flask, REST APIs, Gemini API, GitHub API, HTML, CSS"}, {"category": "Software Development", "technologies": "Git, Linux, OOP, Agile, Modular Architecture, SDLC"}], "experience": [{"title": "AI Internship", "company": "Elevvo", "date_from": "Jun 2024", "date_to": "Present", "responsibilities": "Developing a full-stack web app to transform resumes and online profiles into ATS-compliant CVs using the Gemini LLM API and NLP.\nBuilding a real-time content editor with PDF export, leveraging Flask, PyMuPDF, and a modular architecture.\nCreated a mobile app that identifies products from images using MobileNet with 99% accuracy.\nBuilt a hybrid recommendation system combining content-based filtering (Sentence-BERT) and collaborative filtering (LightFM) to suggest local alternatives.\nDeveloped a Unity game where difficulty adapts to player performance using reinforcement learning.\nIntegrated an ONNX model that adjusts speed and obstacles in real-time based on player score.\n"}], "education": [{"degree": "BSc., Computer Science", "school": "University of Ein Shams", "date_from": "Oct 2021", "date_to": "Aug 2025", "achievements": "Cumulative Grade: B, GP: A\nCoursework: Introduction to Machine Learning, Data Science, Neural Network\n"}, {"degree": "High School Diploma", "school": "Tiba International School", "date_from": "Sep 2017", "date_to": "Jun 2020", "achievements": "SAT: 1270 , ACT: 31\n"}], "projects": [{"name": "AI-Powered Resume Builder", "date_from": "May 2025", "date_to": "Present", "link": null, "description": "Developing a full-stack web application using Flask and the Gemini API to transform resumes and online profiles into ATS-compliant CVs, focusing on NLP techniques to optimize content.\n"}, {"name": "Local Product Finder (GP)", "date_from": "Jul 2024", "date_to": "Jun 2025", "link": null, "description": "Built a hybrid recommendation system combining content-based filtering (Sentence-BERT) and collaborative filtering (LightFM) to suggest local alternatives, enhancing user experience through personalized suggestions.\n"}, {"name": "AlphaLearn Game", "date_from": "Jul 2024", "date_to": "May 2025", "link": null, "description": "Developed a Unity game where difficulty adapts to player performance using reinforcement learning, integrating an ONNX model to adjust speed and obstacles in real-time based on player score.\n"}, {"name": "Cancer-prediction", "date_from": null, "date_to": null, "link": null, "description": "Implemented machine learning models in a Jupyter Notebook to classify breast cancer tumors as malignant or benign based on features extracted from digitized images, utilizing the Breast Cancer Wisconsin (Diagnostic) dataset.\n"}], "certificates": [{"name": "Mathematics for Machine Learning", "issuer": "DeepLearning.AI / Coursera", "year": "2024", "description": "Completed a course focused on the mathematical foundations required for machine learning. Gained proficiency in linear algebra, calculus, and probability."}, {"name": "CS50’s Introduction to Artificial Intelligence with Python", "issuer": "Harvard Course", "year": "2023", "description": "Completed Harvard's CS50 AI course, learning fundamental AI concepts using Python. Explored search algorithms, machine learning, and knowledge representation."}, {"name": "CS50: Introduction to Computer Science", "issuer": "Harvard Course", "year": "2022", "description": "Completed Harvard's CS50 course, gaining a solid foundation in computer science principles. Covered topics such as data structures, algorithms, and software engineering."}]}